InformationRegisters/__НастройкиВебСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__НастройкиВебСервиса</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВебСервисИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСервисВидМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМеню</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСервисРежимРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСервисПериодНеактивностиСеансов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСервисПериодХраненияНеактивнныхСеансов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверПечатиПриостановить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверПечатиПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверПечатиПериодИнтервалаПечати</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверПечатиПериодХраненияЗаданий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСерверКаталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСерверИдентификаторПубликации</Name>
					<Comment>Идентификатор публикации на web-сервере.</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСерверКаталогПублицкации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСерверКаталогИзображений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСерверURLИзображений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__НастройкиВебСервиса/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Подавление проверки.
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не Запись.ВебСервисИспользовать Тогда
			ПроверяемыеРеквизиты.Очистить();	
		КонецЕсли;
		Прервать;
		
	КонецЦикла;

КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Веб-сервис.
		Запись.ВебСервисПериодНеактивностиСеансов = Мин(Макс(Запись.ВебСервисПериодНеактивностиСеансов, '0001.01.01 00:00:05'), '0001.01.01 01:00:00');
		Запись.ВебСервисПериодХраненияНеактивнныхСеансов = Макс(Запись.ВебСервисПериодХраненияНеактивнныхСеансов, Запись.ВебСервисПериодНеактивностиСеансов + 15, '0001.01.01 00:15:00');
		
		// Сервер печати.
		Запись.СерверПечатиПериодИнтервалаПечати = Мин(Макс(Запись.СерверПечатиПериодИнтервалаПечати, '0001.01.01 00:00:05'), '0001.01.01 00:01:00');
		Запись.СерверПечатиПериодХраненияЗаданий = Макс(Запись.СерверПечатиПериодХраненияЗаданий, Запись.СерверПечатиПериодИнтервалаПечати + 15, '0001.01.01 00:15:00');
		
		// Веб-сервер.
		Если Запись.ВебСервисИспользовать Тогда
			Если Не ЗначениеЗаполнено(Запись.ВебСерверИдентификаторПубликации) Тогда
				Запись.ВебСерверИдентификаторПубликации = Новый УникальныйИдентификатор;
			КонецЕсли;
			Запись.ВебСерверКаталогПублицкации = РегистрыСведений.__НастройкиВебСервиса.ПолучитьПутьСтандартаПлатформы(Запись.ВебСерверКаталог, ТипПлатформы.Linux_x86) + "/2k/" + Запись.ВебСерверИдентификаторПубликации;
			Запись.ВебСерверКаталогИзображений = Запись.ВебСерверКаталогПублицкации + "/pic/";
			Запись.ВебСерверURLИзображений = "/../2k/" + Запись.ВебСерверИдентификаторПубликации + "/pic/";
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Удаление связанных данных.
		Если Не Запись.ВебСервисИспользовать Тогда
			РегистрыСведений.__СостояниеСеансовВебСервиса.СоздатьНаборЗаписей().Записать();
			РегистрыСведений.__СостояниеЗаданийСервераПечати.СоздатьНаборЗаписей().Записать();
			РегистрыСведений.__ЗначенияСеансовВебСервиса.СоздатьНаборЗаписей().Записать();
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;
	
КонецПроцедуры // ПриЗаписи()
